taskt/Core/Automation/Commands/JSONGroup/AJSONInputJSONCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AJSONInputJSONCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AJSONGetFromJSONCommands" [ label="AJSONGetFromJSONCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONInputJSONCommands" [ label="AJSONInputJSONCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONJSONPathCommands" [ label="AJSONJSONPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONValueActionCommands" [ label="AJSONValueActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands" [ label="AJSONGetFromJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands" [ label="AJSONAddInsertSetJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.RemoveJSONArrayItemCommand" [ label="RemoveJSONArrayItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.RemoveJSONObjectPropertyCommand" [ label="RemoveJSONObjectPropertyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CreateJSONVariableCommand" [ label="CreateJSONVariableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValueFromJSONArrayCommand" [ label="GetJSONValueFromJSONArrayCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValueCommand" [ label="GetJSONValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValuesAsDataTableCommand" [ label="GetJSONValuesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValuesAsDictionaryCommand" [ label="GetJSONValuesAsDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValueFromJSONObjectCommand" [ label="GetJSONValueFromJSONObjectCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertJSONToDataTableCommand" [ label="ConvertJSONToDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertJSONToDictionaryCommand" [ label="ConvertJSONToDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ConvertJSONToListCommand" [ label="ConvertJSONToListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.GetJSONValuesAsListCommand" [ label="GetJSONValuesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands" [ label="AJSONInsertValueToJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands" [ label="AJSONSetValueOfJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AddJSONArrayItemCommand" [ label="AddJSONArrayItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AddJSONObjectPropertyCommand" [ label="AddJSONObjectPropertyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueCommand" [ label="SetJSONValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.InsertJSONArrayItemCommand" [ label="InsertJSONArrayItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.InsertJSONObjectPropertyCommand" [ label="InsertJSONObjectPropertyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueOfJSONArrayCommand" [ label="SetJSONValueOfJSONArrayCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueOfJSONObjectCommand" [ label="SetJSONValueOfJSONObjectCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AJSONGetFromJSONCommands" -> "taskt.Core.Automation.Commands.AJSONInputJSONCommands";
"taskt.Core.Automation.Commands.AJSONJSONPathCommands" -> "taskt.Core.Automation.Commands.AJSONInputJSONCommands";
"taskt.Core.Automation.Commands.AJSONValueActionCommands" -> "taskt.Core.Automation.Commands.AJSONInputJSONCommands";
"taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONGetFromJSONCommands";
"taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONJSONPathCommands";
"taskt.Core.Automation.Commands.RemoveJSONArrayItemCommand" -> "taskt.Core.Automation.Commands.AJSONJSONPathCommands";
"taskt.Core.Automation.Commands.RemoveJSONObjectPropertyCommand" -> "taskt.Core.Automation.Commands.AJSONJSONPathCommands";
"taskt.Core.Automation.Commands.CreateJSONVariableCommand" -> "taskt.Core.Automation.Commands.AJSONValueActionCommands";
"taskt.Core.Automation.Commands.GetJSONValueFromJSONArrayCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.GetJSONValueCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.GetJSONValuesAsDataTableCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.GetJSONValuesAsDictionaryCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.GetJSONValueFromJSONObjectCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.ConvertJSONToDataTableCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.ConvertJSONToDictionaryCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.ConvertJSONToListCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.GetJSONValuesAsListCommand" -> "taskt.Core.Automation.Commands.AJSONGetFromJContainerCommands";
"taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AddJSONArrayItemCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AddJSONObjectPropertyCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.InsertJSONArrayItemCommand" -> "taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands";
"taskt.Core.Automation.Commands.InsertJSONObjectPropertyCommand" -> "taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueOfJSONArrayCommand" -> "taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueOfJSONObjectCommand" -> "taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands";
}
